       IDENTIFICATION DIVISION.
       PROGRAM-ID.PROG38.
      *> PROGRAMA PARA INSERIR DADOS EM ARQUIVO INDEXADO IV
      *> WRITE COM INVALID KEY EM TABS DIFERENTES + 
      *> ALTERANDO REGISTROS
      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *> SELFUNCIONARIO TAB   
           COPY "SELFUNCIONARIO.COB".
           DATA DIVISION.
           FILE SECTION.
      *> FDFUNCIONARIO TAB  
           COPY "FDFUNCIONARIO.COB".
      WORKING-STORAGE SECTION.

      77   REGISTRO-ENCONTRADO PIC X.
      *> POSSUI O MESMO TAMANHO DO CODIGO DO FUNCIONARIO
      77   CODIGO-FUNCIONARIO-ALTERAR PIC 9(5).
      *> CAMPO QUAL SERA ALTERADO
      77   QUAL-CAMPO PIC 9.

      PROCEDURE DIVISION.
      PROGRAM-BEGIN.
           OPEN I-O ARQUIVO-FUNCIONARIO.
           PERFORM PEGA-REGISTRO-FUNCIONARIO.

           PERFORM ALTERAR-REGISTRO
              UNTIL FUNCIONARIO-CODIGO = ZEROS.
           
           CLOSE ARQUIVO-FUNCIONARIO.
      PROGRAM-DONE.
           STOP-RUN.
      
      PEGA-REGISTRO-FUNCIONARIO.
      *> INICIALIZACAO DAS VARIAVEIS
           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.
      *> PERGUNTA QUAL REGISTRO QUER ALTERAR
      DISPLAY "QUAL CODIGO DO FUNCIONARIO QUER ALTERAR?"
      DISPLAY "OU DIGITE 0 (ZERO) PARA CANCELAR...".
      ACCEPT CODIGO-FUNCIONARIO-ALTERAR.

      *> ATRIBUI O CODIGO FORNECIDO AO REGISTRO
      MOVE CODIGO-FUNCIONARIO-ALTERAR TO FUNCIONARIO-CODIGO.
      MOVE "N" TO REGISTRO-ENCONTRADO.

      PERFORM ENCONTRAR-REGISTRO-FUNCIONARIO 
           UNTIL REGISTRO-ENCONTRADO = "S" OR 
              FUNCIONARIO-CODIGO = ZEROES.

      ENCONTRAR-REGISTRO-FUNCIONARIO.
           MOVE "S" TO REGISTRO-ENCONTRADO.
           READ ARQUIVO-FUNCIONARIO RECORD 
      *>   SE NAO ENCONTRAR O REGISTRO ATRIBUI N
            INVALID KEY 
             MOVE "N" TO REGISTRO-ENCONTRADO.

           IF REGISTRO-ENCONTRADO = "N"
              DISPLAY "REGISTRO NAO ENCONTRADO"
              DISPLAY  "INFORME O CODIGO DO FUNCIONARIO"
              DISPLAY "PARA ALTERAR(1-9999)"
              DISPLAY "OU DIGITE 0 (ZERO) PARA CANCELAR...".
              ACCEPT CODIGO-FUNCIONARIO-ALTERAR.
           MOVE CODIGO-FUNCIONARIO-ALTERAR TO FUNCIONARIO-CODIGO.

       ALTERAR-REGISTRO.
      *>   EXIBIR TODOS OS CAMPOS DO REGISTRO 
       DISPLAY " ".
       DISPLAY "CODIGO: " FUNCIONARIO-CODIGO.
       DISPLAY "1. NOME: " FUNCIONARIO-NOME.
       DISPLAY "2. ENDERECO: " FUNCIONARIO-ENDERECO.
       DISPLAY "3. TELEFONE: " FUNCIONARIO-TELEFONE.
       DISPLAY "4. EMAIL: " FUNCIONARIO-EMAIL.
       DISPLAY " ".
      
      *> O USUARIO DEVE ESCOLHAR O CAMPO PARA ALTERAR
       DISPLAY "DIGITE O NUMERO DO CAMPO: ".
       DISPLAY "PARA ALTERAR OU ZERO (0) PARA SAIR".
       ACCEPT QUAL-CAMPO.

           IF QUAL-CAMPO > 4
           DISPLAY "VALOR NAO PERMITIDO, DIGITE 1 A 4 OU 0 (ZERO)".
           ACCEPT QUAL-CAMPO.
           PERFORM MUDA-E-GRAVA-CAMPO.

           PERFORM PEGA-REGISTRO-FUNCIONARIO.
          
       MUDA-E-GRAVA-CAMPO.
      *> 
           IF QUAL-CAMPO = 1
           DISPLAY "INFORME O NOVO NOME: "
           ACCEPT FUNCIONARIO-NOME.

           IF QUAL-CAMPO = 2
           DISPLAY "INFORME O NOVO ENDERECO: "
           ACCEPT FUNCIONARIO-ENDERECO.

           IF QUAL-CAMPO = 3
           DISPLAY "INFORME O NOVO TELEFONE: "
           ACCEPT FUNCIONARIO-TELEFONE.

           IF QUAL-CAMPO = 4
           DISPLAY "INFORME O NOVO EMAIL: "
           ACCEPT FUNCIONARIO-EMAIL.
      
       PERFORM REESCREVER-REGISTRO.

       REESCREVER-REGISTRO.
           REWRITE FUNCIONARIO-REGISTRO
              INVALID KEY 
              DISPLAY "ERRO AO REESCREVER O REGISTRO".