       IDENTIFICATION DIVISION.
       PROGRAM-ID.PROG35.
      *> PROGRAMA PARA INSERIR DADOS EM ARQUIVO INDEXADO
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQUIVO-FUNCIONARIO
            ASSIGN TO "funcionarios.dat"
            ORGANIZATION IS INDEXED
            RECORD KEY IS FUNCIONARIO-CODIGO
            ACCESS MODE IS DYNAMIC.
           DATA DIVISION.
           FILE SECTION.
           FD ARQUIVO-FUNCIONARIO.
           01 FUNCIONARIO-REGISTRO.
              05 FUNCIONARIO-CODIGO PIC 9(4).
              05 FUNCIONARIO-NOME PIC X(20).
              05 FUNCIONARIO-ENDERECO PIC X(50).
              05 FUNCIONARIO-TELEFONE PIC X(15).
              05 FUNCIONARIO-EMAIL PIC X(30).
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           OPEN I-O ARQUIVO-FUNCIONARIO.
           PERFORM LER-E-ESCREVER-REGISTRO.
           
           CLOSE ARQUIVO-FUNCIONARIO.
       PROGRAM-DONE.
           STOP RUN.

       LER-E-ESCREVER-REGISTRO.
           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.
           DISPLAY "INFORME O CODIGO DO FUNCIONARIO (1-999): ".
           ACCEPT FUNCIONARIO-CODIGO.
           DISPLAY "INFORME O NOME DO FUNCIONARIO: ".
           ACCEPT FUNCIONARIO-NOME.
           DISPLAY "INFORME O ENDERECO: ".
           ACCEPT FUNCIONARIO-ENDERECO.
           DISPLAY "INFORME O TELEFONE: ".
           ACCEPT FUNCIONARIO-TELEFONE.
           DISPLAY "INFORME O EMAIL: ".
           ACCEPT FUNCIONARIO-EMAIL.

           WRITE FUNCIONARIO-REGISTRO.