       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG20.
       *>  THIS PROGRAM CALCULATES THE MULTIPLICATION OF A NUMBER 
       *>  GIVEN THE NUMBER OF TIMES - USING PERFORM.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMERO  PIC 99.
       01  MULTIP PIC 999.
       01  PRODUTO  PIC 9(4).
       01  QUANTOS  PIC 99.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           PERFORM INICIALIZACAO-PROGRAMA.
           PERFORM PEGA-TABUADA.
           PERFORM EXIBIR-TABUADA.

       PROGRAM-DONE.
           STOP RUN.
       
       INICIALIZACAO-PROGRAMA.
           MOVE 0 TO MULTIP.

       PEGA-TABUADA.
           DISPLAY "QUAL A TABUADA DE MULTIPLICACAO?".
           ACCEPT NUMERO.
           DISPLAY "QUAL O TAMANHO DA TABUADA?".
           ACCEPT QUANTOS.

       EXIBIR-TABUADA.
           DISPLAY " A TABUADA DE MULTIPLICACAO DE " NUMERO " EH ".
           PERFORM CALCULA-EXIBE QUANTOS TIMES.

       CALCULA-EXIBE.
           ADD 1 TO MULTIP.
           COMPUTE PRODUTO = NUMERO * MULTIP.
           DISPLAY
           NUMERO " * " MULTIP " EH IGUAL A " PRODUTO.
           