       IDENTIFICATION DIVISION.
       PROGRAM-ID.PROG38.
      *> PROGRAMA PARA INSERIR DADOS EM ARQUIVO INDEXADO IV
      *> WRITE COM INVALID KEY EM TABS DIFERENTES + 