       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG39.
      *> CRIADO POR MARIANE - PARA EXCLUIR REGISTROS DO ARQUIVO
      *> AGOSTO 2022
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *> COPIANDO 
           COPY "SELFUNCIONARIO.COB".
       DATA DIVISION.
       FILE SECTION.
           COPY "FDFUNCIONARIO.COB".

       WORKING-STORAGE SECTION.

       77  REGISTRO-ENCONTRADO PIC X.
       77  CODIGO-FUNCIONARIO-EXCLUIR PIC 9(5).
       77  CONFIRMAR-EXCLUSAO   PIC X.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           OPEN I-O ARQUIVO-FUNCIONARIO.
      *>  PEGA REGISTRO FUNCIONARIO EH SIMILAR NO ALTERAR
           PERFORM PEGA-REGISTRO-FUNCIONARIO.

           PERFORM DELETAR-REGISTRO
              UNTIL FUNCIONARIO-CODIGO = ZEROES.
           CLOSE ARQUIVO-FUNCIONARIO.

       PROGRAM-DONE.
         STOP RUN.
       PEGA-REGISTRO-FUNCIONARIO.
           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.
           DISPLAY "INFORME O CODIGO DO FUNCIONARIO P EXCLUIR: ".
           DISPLAY "OU ZERO PARA SAIR".
           ACCEPT CODIGO-FUNCIONARIO-EXCLUIR.

           MOVE CODIGO-FUNCIONARIO-EXCLUIR TO FUNCIONARIO-CODIGO.
           MOVE "N" TO REGISTRO-ENCONTRADO.

           PERFORM ENCONTRA-REGISTRO-FUNCIONARIO
              UNTIL REGISTRO-ENCONTRADO = "S" OR
               FUNCIONARIO-CODIGO = ZEROES.

       ENCONTRA-REGISTRO-FUNCIONARIO.
           MOVE "S" TO REGISTRO-ENCONTRADO.
           READ ARQUIVO-FUNCIONARIO RECORD
              INVALID KEY 
              MOVE "N" TO REGISTRO-ENCONTRADO.
           IF REGISTRO-ENCONTRADO = "N"
              DISPLAY "REGISTRO NAO ENCONTRADO"
              DISPLAY "INFORME O CODIGO DO FUNCIONARIO"
              DISPLAY "PARA EXCLUIR (ZERO PARA SAIR)"
              ACCEPT CODIGO-FUNCIONARIO-EXCLUIR.

           MOVE CODIGO-FUNCIONARIO-EXCLUIR TO FUNCIONARIO-CODIGO.

       DELETAR-REGISTRO.
      *> EXIBIR OS CAMPOS DO REGISTRO
           DISPLAY " ".
           DISPLAY "CODIGO: " FUNCIONARIO-CODIGO.
           DISPLAY "NOME: " FUNCIONARIO-NOME.
           DISPLAY "ENDERECO: " FUNCIONARIO-ENDERECO
           DISPLAY "TELEFONE: " FUNCIONARIO-TELEFONE.
           DISPLAY "EMAIL: " FUNCIONARIO-EMAIL.
           DISPLAY "  ".

           MOVE "X" TO CONFIRMAR-EXCLUSAO.
      *> REPARE QUE ESTA IDENTADO
           PERFORM PERGUNTA-EXCLUIR
              UNTIL CONFIRMAR-EXCLUSAO = "S" OR "N".
           IF CONFIRMAR-EXCLUSAO = "S"
              DELETE ARQUIVO-FUNCIONARIO RECORD
                INVALID KEY
                 DISPLAY "ERRO AO EXCLUIR O REGISTRO".
           PERFORM PEGA-REGISTRO-FUNCIONARIO.
       PERGUNTA-EXCLUIR.
           DISPLAY "DESEJA EXLUIR ESSE REGISTRO (S OU N)?".
           ACCEPT CONFIRMAR-EXCLUSAO.
      *> AQUI ESTOU CONVERTENDO S MINUSCULO EM S MAISCULO
           IF CONFIRMAR-EXCLUSAO = "s"
              MOVE "S" TO CONFIRMAR-EXCLUSAO.
           IF CONFIRMAR-EXCLUSAO = "n"
              MOVE "N" TO CONFIRMAR-EXCLUSAO.
           
           IF CONFIRMAR-EXCLUSAO NOT = "S" AND
              CONFIRMAR-EXCLUSAO NOT = "N"
              DISPLAY "VOCE DEVE ESCOLHER S OU N".

                 
            


           
        


