      IDENTIFICATION DIVISION.
      PROGRAM-ID. PROG26.
   *> NUMEROS DECIMAIS 
   *> 
      ENVIRONMENT DIVISION.
      DATA DIVISION.
      WORKING-STORAGE SECTION.

      01   VALOR1   PIC 9(5)V9(2) VALUE 8753.98.
      01   VALOR2   PIC 9(2)V9(2) VALUE 12.11.
      01   RESULT   PIC 9(5)V9(2).
      01   VALOR3   PIC S999V99 VALUE -865.21.
      01   RESULTADO2   PIC S9(5)V9(2).
      
      PROCEDURE DIVISION.
      PROGRAM-BEGIN.
           COMPUTE RESULT = VALOR1 + VALOR2.
           DISPLAY VALOR1 " + " VALOR2 " = " RESULT.
           DISPLAY "=================="
           COMPUTE RESULTADO2 = VALOR2 + VALOR3.
           DISPLAY VALOR2 "+ " VALOR3 "= " RESULTADO2.
       PROGRAM-DONE.
       STOP RUN.
       